{
  "recipes": [
    {
      "id": 1,
      "title": "Dutch Oven Campfire Chili",
      "description": "Hearty chili cooked in a Dutch oven over campfire coals.",
      "ingredients": "1 lb ground beef, 2 cans beans, 3 cans tomatoes, 2 tbsp chili powder",
      "userId": 1,
      "steps": "Combine all ingredients in a Dutch oven, cook over campfire coals for 1-2 hours.",
      "categoryId": 10,
      "mealId": 3,
      "date": "2024-01-28T18:30:00Z",
      "image": "/images/recipe/chili.jpeg"
    },
    {
      "id": 2,
      "title": "Campfire Pizza",
      "description": "Delicious pizza cooked in a Dutch oven over a campfire.",
      "ingredients": "1 package pizza dough, 1 cup tomato sauce, 2 cups cheese, toppings of your choice",
      "userId": 2,
      "steps": "Roll out pizza dough, add sauce, top with cheese, add toppings of your choice, Cook in a preheated Dutch oven over campfire until the crust is golden.",
      "categoryId": 8,
      "mealId": 3,
      "date": "2024-01-29T12:45:00Z",
      "image": "/images/recipe/campfire-pizza.jpeg"
    },
    {
      "id": 3,
      "title": "Dutch Oven Peach Cobbler",
      "description": "Sweet peach cobbler baked in a Dutch oven over campfire coals.",
      "ingredients": "4 peaches, 1 cup sugar, 1.5 cups flour, 0.5 cup butter, 1 tsp cinnamon",
      "userId": 1,
      "steps": "Mix peaches sugar and cinnamon in a Dutch oven, layer peaches and cover with a mixture of flour sugar and butter, Cook in the campfire coals until bubbly and golden brown.",
      "categoryId": 3,
      "mealId": 4,
      "date": "2024-01-30T09:15:00Z",
      "image": "/images/recipe/peach-cobbler.jpeg"
    },
    {
      "id": 4,
      "title": "Campfire Grilled Chicken Skewers",
      "description": "Flavorful chicken skewers grilled over a campfire for the perfect outdoor meal.",
      "ingredients": "1 lb chicken breast, bell peppers, onions, olive oil, salt, pepper",
      "userId": 3,
      "steps": "Marinate chicken in olive oil salt and pepper, Skewer chicken with bell peppers and onions, Grill over the campfire until chicken is cooked through",
      "categoryId": 6,
      "mealId": 3,
      "date": "2024-01-31T15:20:00Z",
      "image": "/images/recipe/sweker.jpg"
    },
    {
      "id": 5,
      "title": "Dutch Oven Bacon and Cheese Campfire Potatoes",
      "description": "Savory bacon and cheese potatoes cooked in a Dutch oven over campfire coals.",
      "ingredients": "4 potatoes, 1 cup shredded cheese, 6 slices bacon, green onions",
      "userId": 4,
      "steps": "Slice potatoes and layer in a Dutch oven, Top with shredded cheese and bacon, Cook over campfire coals until potatoes are tender and bacon is crispy, Garnish with chopped green onions",
      "categoryId": 11,
      "mealId": 3,
      "date": "2024-02-01T20:00:00Z",
      "image": "/images/recipe/cheesy-potatoes.webp"
    },
    {
      "id": 6,
      "title": "Dutch Oven Campfire Breakfast Burritos",
      "description": "Hearty breakfast burritos cooked in a Dutch oven over campfire coals.",
      "ingredients": "8 eggs, sausage, tortillas, cheese, salsa",
      "userId": 3,
      "steps": "Scramble eggs in Dutch oven, Set eggs aside, Cook the sausage in the dutch oven, Once sausage is cooked add eggs back in, Assemble burritos with egg and sausage mixture, Top with cheese and salsa, Warm in the Dutch oven over campfire coals",
      "categoryId": 12,
      "mealId": 1,
      "date": "2024-02-02T07:30:00Z",
      "image": "/images/recipe/breakfast-burrito.jpeg"
    },
    {
      "id": 7,
      "title": "Dutch Oven Campfire Jambalaya",
      "description": "Spicy and flavorful jambalaya cooked in a Dutch oven over campfire coals.",
      "ingredients": "1 lb Andouille sausage, 1 lb chicken thighs, 1 onion, 1 bell pepper, 2 celery stalks, 2 cups rice, 3 cups chicken broth, Cajun seasoning",
      "userId": 2,
      "steps": "Brown sausage and chicken in the Dutch oven, add chopped vegetables, stir in rice and broth, season with Cajun spices, cover and simmer over campfire until rice is cooked.",
      "categoryId": 10,
      "mealId": 3,
      "date": "2024-02-03T18:30:00Z",
      "image": "/images/recipe/jambalaya.jpeg"
    },
    {
      "id": 8,
      "title": "Campfire Veggie Skewers with Herb Marinade",
      "description": "Colorful vegetable skewers with a flavorful herb marinade, grilled to perfection over a campfire.",
      "ingredients": "Bell peppers, cherry tomatoes, zucchini, mushrooms, red onion, olive oil, garlic, rosemary, thyme, salt, pepper",
      "userId": 3,
      "steps": "Thread vegetables onto skewers, mix olive oil, minced garlic, and chopped herbs for the marinade, grill skewers over campfire until veggies are tender.",
      "categoryId": 6,
      "mealId": 3,
      "date": "2024-02-04T12:45:00Z",
      "image": "/images/recipe/veggie-skewer.jpg"
    },
    {
      "id": 9,
      "title": "Dutch Oven Cornbread",
      "description": "Moist and golden cornbread baked in a Dutch oven over campfire coals.",
      "ingredients": "1 cup cornmeal, 1 cup all-purpose flour, 1 tbsp baking powder, 1/2 tsp salt, 1 cup milk, 1/4 cup melted butter, 1/4 cup honey",
      "userId": 1,
      "steps": "Mix dry ingredients, add milk, melted butter, and honey, stir until just combined, pour into greased Dutch oven, bake over campfire until a toothpick comes out clean.",
      "categoryId": 1,
      "mealId": 4,
      "date": "2024-02-05T09:15:00Z",
      "image": "/images/recipe/bread.jpg"
    },
    {
      "id": 10,
      "title": "Campfire Quesadillas",
      "description": "Cheesy and satisfying quesadillas cooked in a cast iron skillet over a campfire.",
      "ingredients": "Flour tortillas, shredded cheese, cooked chicken or beef, bell peppers, onions, salsa, sour cream",
      "userId": 4,
      "steps": "Place tortilla in a hot skillet, add cheese, meat, veggies, and another layer of cheese, top with another tortilla, cook on both sides until cheese is melted.",
      "categoryId": 12,
      "mealId": 2,
      "date": "2024-02-06T15:20:00Z",
      "image": "/images/recipe/Quesadillas.webp"
    },
    {
      "id": 11,
      "title": "Dutch Oven Campfire Lasagna",
      "description": "Layers of pasta, meat sauce, and cheese baked to perfection in a Dutch oven over campfire coals.",
      "ingredients": "Lasagna noodles, ground beef, marinara sauce, ricotta cheese, mozzarella cheese, Parmesan cheese, Italian seasoning",
      "userId": 8,
      "steps": "Brown beef in Dutch oven, add marinara sauce and seasoning, layer noodles and cheese, repeat, cover and cook over campfire until noodles are tender.",
      "categoryId": 4,
      "mealId": 3,
      "date": "2024-02-07T20:00:00Z",
      "image": "/images/recipe/lasagna.jpeg"
    },
    {
      "id": 12,
      "title": "Campfire Garlic Butter Shrimp",
      "description": "Succulent shrimp marinated in garlic butter and grilled over a campfire.",
      "ingredients": "Shrimp, garlic, melted butter, lemon juice, parsley, salt, pepper",
      "userId": 3,
      "steps": "Combine melted butter, minced garlic, lemon juice, and chopped parsley, marinate shrimp, skewer and grill over campfire until shrimp are pink and opaque.",
      "categoryId": 13,
      "mealId": 2,
      "date": "2024-02-08T07:30:00Z",
      "image": "/images/recipe/Garlic-Butter-Shrimp.jpg"
    },
    {
      "id": 13,
      "title": "Dutch Oven Campfire Mac and Cheese",
      "description": "Creamy and cheesy macaroni and cheese cooked in a Dutch oven over campfire coals.",
      "ingredients": "Elbow macaroni, cheddar cheese, milk, butter, flour, salt, pepper",
      "userId": 10,
      "steps": "Cook macaroni in the Dutch oven, make a roux with butter and flour, add milk and cheese, stir in cooked macaroni, cook until cheese is melted and bubbly.",
      "categoryId": 4,
      "mealId": 2,
      "date": "2024-02-09T18:30:00Z",
      "image": "/images/recipe/Camping-Mac-n-Cheese.webp"
    },
    {
      "id": 14,
      "title": "Campfire Sausage and Veggie Foil Packets",
      "description": "Easy and customizable foil packets with sausages and veggies, cooked over a campfire.",
      "ingredients": "Sausages, potatoes, carrots, bell peppers, onions, olive oil, garlic, herbs, salt, pepper",
      "userId": 9,
      "steps": "Chop ingredients, place on a foil sheet, drizzle with olive oil, add minced garlic and herbs, seal the foil packets, cook over campfire until veggies are tender.",
      "categoryId": 6,
      "mealId": 3,
      "date": "2024-02-10T12:45:00Z",
      "image": "/images/recipe/Veggies-and-Sausage-Foil-Packs.jpeg"
    },
    {
      "id": 15,
      "title": "Dutch Oven Apple and Cinnamon Breakfast Rolls",
      "description": "Sweet and gooey cinnamon rolls with apple filling, baked in a Dutch oven over campfire coals.",
      "ingredients": "Refrigerated cinnamon roll dough, apples, brown sugar, cinnamon, butter",
      "userId": 10,
      "steps": "Roll out cinnamon roll dough, spread with apple mixture, roll up and slice into rolls, place in greased Dutch oven, bake over campfire until golden.",
      "categoryId": 3,
      "mealId": 1,
      "date": "2024-02-11T09:15:00Z",
      "image": "/images/recipe/cinnamon-rolls.jpeg"
    },
    {
      "id": 16,
      "title": "Campfire Banana S'mores",
      "description": "A twist on classic s'mores with banana slices, grilled to perfection over a campfire.",
      "ingredients": "Graham crackers, chocolate bars, marshmallows, bananas",
      "userId": 8,
      "steps": "Place banana slices on graham crackers, top with chocolate and marshmallow, sandwich with another cracker, grill over campfire until marshmallow is gooey and chocolate is melted.",
      "categoryId": 3,
      "mealId": 4,
      "date": "2024-02-12T20:00:00Z",
      "image": "/images/recipe/smore.jpg"
    },
    {
      "id": 17,
      "title": "Dutch Oven Campfire Enchiladas",
      "description": "Flavorful enchiladas cooked in a Dutch oven over campfire coals.",
      "ingredients": "1 lb ground beef, 1 onion, 1 can black beans, 1 can enchilada sauce, tortillas, shredded cheese",
      "userId": 8,
      "steps": "Brown beef and onions in the Dutch oven, add beans and enchilada sauce, fill tortillas and roll them up, top with cheese, cook until cheese is melted.",
      "categoryId": 12,
      "mealId": 3,
      "date": "2024-02-13T15:20:00Z",
      "image": "/images/recipe/dutch-oven-enchiladas.jpeg"
    },
    {
      "id": 18,
      "title": "Campfire Shrimp Boil",
      "description": "Classic shrimp boil with potatoes, corn, and sausage, cooked over a campfire.",
      "ingredients": "Shrimp, potatoes, corn on the cob, smoked sausage, Old Bay seasoning, lemons",
      "userId": 5,
      "steps": "Boil water in a large pot or Dutch oven, add Old Bay seasoning, potatoes, corn, and sausage, cook until potatoes are tender, add shrimp and cook until pink, serve with lemon wedges.",
      "categoryId": 13,
      "mealId": 3,
      "date": "2024-02-14T20:00:00Z",
      "image": "/images/recipe/Shrimp-Boil.webp"
    },
    {
      "id": 19,
      "title": "Dutch Oven Campfire Paella",
      "description": "A Spanish-inspired paella cooked in a Dutch oven over campfire coals.",
      "ingredients": "Chicken thighs, chorizo, shrimp, rice, saffron, chicken broth, bell peppers, peas",
      "userId": 5,
      "steps": "Brown chicken and chorizo in the Dutch oven, add rice, saffron, and broth, arrange shrimp and vegetables on top, cover and simmer over campfire until rice is cooked.",
      "categoryId": 12,
      "mealId": 3,
      "date": "2024-02-15T18:30:00Z",
      "image": "/images/recipe/paella.webp"
    },
    {
      "id": 20,
      "title": "Campfire Sweet Potato and Black Bean Tacos",
      "description": "Vegetarian tacos with roasted sweet potatoes and black beans, cooked over a campfire.",
      "ingredients": "Sweet potatoes, black beans, taco seasoning, tortillas, salsa, avocado",
      "userId": 7,
      "steps": "Roast sweet potatoes in the Dutch oven, add black beans and taco seasoning, warm tortillas and assemble tacos, top with salsa and avocado.",
      "categoryId": 12,
      "mealId": 3,
      "date": "2024-02-16T07:30:00Z",
      "image": "/images/recipe/tacos.webp"
    },
    {
      "id": 21,
      "title": "Dutch Oven Campfire Lemon Blueberry Cake",
      "description": "Moist and flavorful lemon blueberry cake baked in a Dutch oven over campfire coals.",
      "ingredients": "Flour, sugar, baking powder, salt, butter, eggs, milk, lemon zest, blueberries",
      "userId": 6,
      "steps": "Mix dry ingredients, add wet ingredients and fold in blueberries, pour into a greased Dutch oven, bake over campfire coals until a toothpick comes out clean.",
      "categoryId": 3,
      "mealId": 4,
      "date": "2024-02-17T09:15:00Z",
      "image": "/images/recipe/lemon-blueberry.jpeg"
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Bread"
    },
    {
      "id": 2,
      "name": "Curries"
    },
    {
      "id": 3,
      "name": "Desserts"
    },
    {
      "id": 4,
      "name": "Pasta"
    },
    {
      "id": 5,
      "name": "Quiche"
    },
    {
      "id": 6,
      "name": "Roasts"
    },
    {
      "id": 7,
      "name": "Sandwiches"
    },
    {
      "id": 8,
      "name": "Pizza"
    },
    {
      "id": 9,
      "name": "Soups"
    },
    {
      "id": 10,
      "name": "Stews"
    },
    {
      "id": 11,
      "name": "Casserole"
    },
    {
      "id": 12,
      "name": "Mexican Style"
    },
    {
      "id": 13,
      "name": "Fish"
    }
  ],
  "meals": [
    {
      "id": 1,
      "name": "Breakfast"
    },
    {
      "id": 2,
      "name": "Lunch"
    },
    {
      "id": 3,
      "name": "Dinner"
    },
    {
      "id": 4,
      "name": "Snack"
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "John Doe",
      "email": "jdoe@gmal.com",
      "bio": "Food enthusiast with a passion for trying new recipes and creating delicious meals at home. Always on the lookout for unique flavors and cooking techniques to elevate home cooking experiences. Enjoys sharing culinary discoveries with the community. John believes that food has the power to bring people together and create lasting memories. Whether it's experimenting with exotic spices or perfecting classic dishes, John's kitchen is a place of creativity and joy.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/john-doe.jpg"
    },
    {
      "id": 2,
      "name": "Jane Smith",
      "email": "jsmith@gmail.com",
      "bio": "Professional chef with a love for teaching others the art of cooking. Admin of the cooking community, dedicated to fostering a shared passion for culinary excellence. With years of experience in professional kitchens, Jane brings a wealth of knowledge to the community. Her cooking philosophy revolves around the perfect balance of flavors, textures, and presentation. Jane enjoys not only creating mouthwatering dishes but also guiding others on their culinary journeys, helping them discover the joy of cooking.",
      "isAdmin": true,
      "isBlocked": false,
      "image": "/images/profile/jane-smith.jpg"
    },
    {
      "id": 3,
      "name": "Alice Johnson",
      "email": "aliceJ@att.net",
      "bio": "Home cook exploring the world of flavors and experimenting with new ingredients. Committed to creating memorable dining experiences at home. Finds joy in discovering and perfecting family-friendly recipes for all occasions. Alice believes that the heart of a home is in its kitchen, and each meal is an opportunity to express love and creativity. From weeknight dinners to special celebrations, Alice's kitchen is a place where delicious aromas and laughter come together.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/alice-johnson.jpg"
    },
    {
      "id": 4,
      "name": "Bob Thompson",
      "email": "bob@example.com",
      "bio": "Passionate about healthy and delicious meals. Sharing recipes for a balanced lifestyle, focusing on nutrition and flavor. A culinary enthusiast dedicated to making cooking accessible to everyone, regardless of dietary preferences. Bob's kitchen is a hub of innovation, where he experiments with alternative ingredients and cooking methods to create dishes that are both wholesome and satisfying. Bob believes that good food is the foundation of a vibrant and energetic life.",
      "isAdmin": false,
      "isBlocked": true,
      "image": "/images/profile/bob-thompson.jpg"
    },
    {
      "id": 5,
      "name": "Eva Rodriguez",
      "email": "eva@example.com",
      "bio": "Baking enthusiast with a love for creating sweet treats. Always experimenting with new dessert recipes, from classic pastries to innovative confections. Enjoys sharing baking tips and spreading the joy of homemade sweets. Eva's kitchen is filled with the aroma of freshly baked delights, and her passion for baking extends beyond the oven. With a penchant for storytelling through desserts, Eva believes that a well-crafted dessert is a work of art that brings joy to both the creator and the indulger.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/eva-rodriguez.jpg"
    },
    {
      "id": 6,
      "name": "David Baker",
      "email": "david@example.com",
      "bio": "Passionate about bread-making and exploring different types of artisanal loaves. A carb lover at heart, always in pursuit of the perfect crust and crumb. Enjoys sharing the art and science of bread-making with the community. David's kitchen is a haven for the aroma of freshly baked bread, and he believes that a good loaf can transform a meal. From sourdough experiments to unique grain combinations, David's bread-making journey is a continuous exploration of flavors and techniques.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/david-baker.jpg"
    },
    {
      "id": 7,
      "name": "Sophie Green",
      "email": "sophie@example.com",
      "bio": "Vegetarian chef with a mission to create delicious and satisfying meat-free meals. Advocating for a plant-based lifestyle, Sophie explores creative ways to incorporate flavors and textures in vegetarian cuisine. Enjoys inspiring others to embrace plant-based cooking. Sophie's kitchen is a colorful and vibrant space, where she turns vegetables into culinary masterpieces. From hearty salads to innovative plant-based proteins, Sophie's vegetarian creations prove that meat-free meals can be both nutritious and indulgent.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/sophie-green.jpg"
    },
    {
      "id": 8,
      "name": "Michael Turner",
      "email": "michael@example.com",
      "bio": "Grilling and BBQ enthusiast. Always in search of the perfect smoky flavor for meats and veggies. Michael enjoys experimenting with different marinades, rubs, and grilling techniques to create mouthwatering dishes. Enjoys sharing grilling tips and recipes with fellow BBQ lovers. Michael's backyard is a haven for sizzling grills and the aroma of smoke. From slow-cooked ribs to perfectly seared steaks, Michael's grilling adventures are a celebration of flavor and outdoor cooking.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/michael-turner.jpg"
    },
    {
      "id": 9,
      "name": "Olivia White",
      "email": "olivia@example.com",
      "bio": "Healthy living advocate focusing on nutritious and wholesome recipes. Sharing tips for a balanced and mindful lifestyle, Olivia strives to create meals that nourish both the body and soul. Enjoys exploring a variety of cuisines with a health-conscious approach. Olivia's kitchen is a laboratory of wellness, where she combines superfoods, fresh produce, and culinary creativity. From nutrient-packed smoothies to vibrant salads, Olivia's recipes showcase that healthy eating can be delicious and satisfying.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/olivia-white.jpg"
    },
    {
      "id": 10,
      "name": "William Grant",
      "email": "william@example.com",
      "bio": "Culinary adventurer exploring global cuisines and bringing international flavors to the home kitchen. William is passionate about discovering authentic recipes from around the world and adapting them for home cooking. Enjoys sharing cultural insights and culinary journeys with the cooking community. William's kitchen is a passport to global flavors, where he explores spices, techniques, and traditions from diverse culinary traditions. From street food to traditional dishes, William's culinary adventures bring the world to his home kitchen.",
      "isAdmin": true,
      "isBlocked": false,
      "image": "/images/profile/william-grant.jpg"
    },
    {
      "id": 11,
      "name": "Linda Williams",
      "email": "linda@example.com",
      "bio": "Passionate about creating healthy and flavorful meals for families. Linda believes in the power of wholesome ingredients and balanced nutrition. Enjoys sharing tips for meal prepping and creating quick, nutritious recipes for busy households. Linda's kitchen is a space where delicious meets nutritious, making every meal a moment of well-being.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/linda.jpg"
    },
    {
      "id": 12,
      "name": "Grace Lee",
      "email": "grace@example.com",
      "bio": "Artistic soul with a flair for food presentation. Grace enjoys turning everyday meals into visual feasts. As an advocate for mindful eating, she believes that a beautifully arranged plate enhances the dining experience. Grace's kitchen is both a studio and a sanctuary, where culinary creativity meets an appreciation for aesthetics.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/grace-lee.jpg"
    },
    {
      "id": 13,
      "name": "Isabella Taylor",
      "email": "isabella@example.com",
      "bio": "Passionate about pastry and confectionery. Isabella finds joy in the artistry of creating exquisite desserts. Enjoys experimenting with flavors, textures, and decorative elements to craft delightful sweet experiences. Isabella's kitchen is a confectionery workshop, where every dessert is a masterpiece of taste and aesthetics.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/isabella.jpg"
    },
    {
      "id": 14,
      "name": "Maria Hernandez",
      "email": "maria@example.com",
      "bio": "Homegrown chef celebrating her cultural heritage through food. Maria is dedicated to preserving family recipes and traditions. Enjoys sharing the rich flavors of her culture with the cooking community. Maria's kitchen is a blend of nostalgia and innovation, where traditional recipes meet contemporary twists.",
      "isAdmin": false,
      "isBlocked": false,
      "image": "/images/profile/maria-hernandez.jpg"
    },
    {
      "id": 15,
      "name": "Sophia Nguyen",
      "email": "sophia@example.com",
      "bio": "Fitness enthusiast passionate about combining taste and health. Sophia focuses on creating meals that fuel an active lifestyle. Enjoys sharing recipes that strike a balance between deliciousness and nutritional value. Sophia's kitchen is a fitness haven, where every dish contributes to overall well-being.",
      "isAdmin": true,
      "isBlocked": false,
      "image": "/images/profile/sophia-nguyen.jpg"
    }
  ],
  "saves": [
    {
      "id": 1,
      "userId": 2,
      "recipeId": 5
    },
    {
      "id": 4,
      "userId": 1,
      "recipeId": 3
    },
    {
      "id": 5,
      "userId": 2,
      "recipeId": 4
    },
    {
      "userId": 3,
      "recipeId": 3,
      "id": 6
    },
    {
      "userId": 3,
      "recipeId": 5,
      "id": 7
    },
    {
      "userId": 4,
      "recipeId": 2,
      "id": 8
    },
    {
      "userId": 4,
      "recipeId": 1,
      "id": 10
    },
    {
      "userId": 4,
      "recipeId": 3,
      "id": 11
    },
    {
      "userId": 4,
      "recipeId": 4,
      "id": 12
    },
    {
      "userId": 1,
      "recipeId": 6,
      "id": 13
    },
    {
      "userId": 1,
      "recipeId": 4,
      "id": 14
    },
    {
      "userId": 3,
      "recipeId": 1,
      "id": 15
    },
    {
      "userId": 2,
      "recipeId": 1,
      "id": 16
    },
    {
      "userId": 9,
      "recipeId": 9,
      "id": 17
    },
    {
      "userId": 9,
      "recipeId": 11,
      "id": 18
    },
    {
      "userId": 9,
      "recipeId": 13,
      "id": 19
    },
    {
      "userId": 10,
      "recipeId": 10,
      "id": 20
    },
    {
      "userId": 10,
      "recipeId": 17,
      "id": 21
    },
    {
      "userId": 10,
      "recipeId": 21,
      "id": 22
    },
    {
      "userId": 8,
      "recipeId": 3,
      "id": 23
    },
    {
      "userId": 8,
      "recipeId": 8,
      "id": 24
    },
    {
      "userId": 6,
      "recipeId": 1,
      "id": 25
    },
    {
      "userId": 6,
      "recipeId": 7,
      "id": 26
    },
    {
      "userId": 6,
      "recipeId": 15,
      "id": 27
    },
    {
      "userId": 6,
      "recipeId": 6,
      "id": 28
    },
    {
      "userId": 6,
      "recipeId": 19,
      "id": 29
    },
    {
      "userId": 6,
      "recipeId": 20,
      "id": 30
    },
    {
      "userId": 5,
      "recipeId": 9,
      "id": 31
    },
    {
      "userId": 5,
      "recipeId": 14,
      "id": 32
    },
    {
      "userId": 5,
      "recipeId": 4,
      "id": 33
    },
    {
      "userId": 5,
      "recipeId": 7,
      "id": 34
    },
    {
      "userId": 5,
      "recipeId": 2,
      "id": 35
    },
    {
      "userId": 9,
      "recipeId": 7,
      "id": 36
    },
    {
      "userId": 8,
      "recipeId": 18,
      "id": 37
    },
    {
      "userId": 7,
      "recipeId": 14,
      "id": 38
    },
    {
      "userId": 7,
      "recipeId": 5,
      "id": 39
    },
    {
      "userId": 7,
      "recipeId": 19,
      "id": 40
    },
    {
      "userId": 7,
      "recipeId": 17,
      "id": 41
    },
    {
      "userId": 7,
      "recipeId": 8,
      "id": 42
    },
    {
      "userId": 3,
      "recipeId": 21,
      "id": 43
    },
    {
      "userId": 2,
      "recipeId": 10,
      "id": 44
    },
    {
      "userId": 2,
      "recipeId": 6,
      "id": 45
    },
    {
      "userId": 1,
      "recipeId": 10,
      "id": 46
    },
    {
      "userId": 1,
      "recipeId": 17,
      "id": 47
    }
  ],
  "ratings": [
    {
      "id": 1,
      "userId": 2,
      "recipeId": 1,
      "stars": 4
    },
    {
      "id": 2,
      "userId": 1,
      "recipeId": 2,
      "stars": 3
    },
    {
      "id": 3,
      "userId": 4,
      "recipeId": 3,
      "stars": 5
    },
    {
      "id": 4,
      "userId": 4,
      "recipeId": 4,
      "stars": 2
    },
    {
      "id": 5,
      "userId": 3,
      "recipeId": 5,
      "stars": 4
    },
    {
      "id": 6,
      "userId": 2,
      "recipeId": 6,
      "stars": 3
    },
    {
      "userId": 1,
      "recipeId": 4,
      "stars": 4,
      "id": 7
    },
    {
      "userId": 1,
      "recipeId": 6,
      "stars": 5,
      "id": 8
    },
    {
      "userId": 1,
      "recipeId": 5,
      "stars": 4,
      "id": 9
    },
    {
      "userId": 3,
      "recipeId": 6,
      "stars": 5,
      "id": 8
    },
    {
      "id": 10,
      "userId": 2,
      "recipeId": 5,
      "stars": 3
    },
    {
      "userId": 9,
      "recipeId": 9,
      "stars": 4,
      "id": 11
    },
    {
      "userId": 9,
      "recipeId": 10,
      "stars": 5,
      "id": 12
    },
    {
      "userId": 9,
      "recipeId": 7,
      "stars": 2,
      "id": 13
    },
    {
      "userId": 9,
      "recipeId": 8,
      "stars": 3,
      "id": 14
    },
    {
      "userId": 9,
      "recipeId": 11,
      "stars": 4,
      "id": 15
    },
    {
      "userId": 9,
      "recipeId": 12,
      "stars": 3,
      "id": 16
    },
    {
      "userId": 9,
      "recipeId": 17,
      "stars": 3,
      "id": 17
    },
    {
      "userId": 9,
      "recipeId": 21,
      "stars": 3,
      "id": 18
    },
    {
      "userId": 9,
      "recipeId": 20,
      "stars": 2,
      "id": 19
    },
    {
      "userId": 9,
      "recipeId": 15,
      "stars": 3,
      "id": 20
    },
    {
      "userId": 9,
      "recipeId": 19,
      "stars": 4,
      "id": 21
    },
    {
      "userId": 9,
      "recipeId": 13,
      "stars": 5,
      "id": 22
    },
    {
      "userId": 9,
      "recipeId": 18,
      "stars": 3,
      "id": 23
    },
    {
      "userId": 9,
      "recipeId": 16,
      "stars": 3,
      "id": 24
    },
    {
      "userId": 10,
      "recipeId": 1,
      "stars": 3,
      "id": 25
    },
    {
      "userId": 10,
      "recipeId": 14,
      "stars": 3,
      "id": 26
    },
    {
      "userId": 10,
      "recipeId": 19,
      "stars": 3,
      "id": 27
    },
    {
      "userId": 10,
      "recipeId": 12,
      "stars": 3,
      "id": 28
    },
    {
      "userId": 10,
      "recipeId": 10,
      "stars": 3,
      "id": 29
    },
    {
      "id": 30,
      "userId": 10,
      "recipeId": 17,
      "stars": 4
    },
    {
      "userId": 10,
      "recipeId": 21,
      "stars": 5,
      "id": 31
    },
    {
      "userId": 8,
      "recipeId": 3,
      "stars": 4,
      "id": 32
    },
    {
      "userId": 8,
      "recipeId": 8,
      "stars": 4,
      "id": 33
    },
    {
      "userId": 6,
      "recipeId": 1,
      "stars": 3,
      "id": 34
    },
    {
      "userId": 6,
      "recipeId": 6,
      "stars": 4,
      "id": 35
    },
    {
      "userId": 6,
      "recipeId": 19,
      "stars": 3,
      "id": 36
    },
    {
      "userId": 6,
      "recipeId": 20,
      "stars": 3,
      "id": 37
    },
    {
      "userId": 5,
      "recipeId": 9,
      "stars": 4,
      "id": 38
    },
    {
      "userId": 5,
      "recipeId": 14,
      "stars": 4,
      "id": 39
    },
    {
      "userId": 5,
      "recipeId": 4,
      "stars": 5,
      "id": 40
    },
    {
      "userId": 5,
      "recipeId": 7,
      "stars": 3,
      "id": 41
    },
    {
      "userId": 5,
      "recipeId": 2,
      "stars": 5,
      "id": 42
    },
    {
      "userId": 8,
      "recipeId": 18,
      "stars": 4,
      "id": 43
    },
    {
      "userId": 7,
      "recipeId": 14,
      "stars": 4,
      "id": 44
    },
    {
      "userId": 7,
      "recipeId": 5,
      "stars": 4,
      "id": 45
    },
    {
      "userId": 7,
      "recipeId": 19,
      "stars": 4,
      "id": 46
    },
    {
      "userId": 7,
      "recipeId": 17,
      "stars": 4,
      "id": 47
    },
    {
      "userId": 7,
      "recipeId": 8,
      "stars": 3,
      "id": 48
    },
    {
      "userId": 3,
      "recipeId": 21,
      "stars": 4,
      "id": 49
    },
    {
      "userId": 2,
      "recipeId": 10,
      "stars": 4,
      "id": 50
    },
    {
      "userId": 1,
      "recipeId": 10,
      "stars": 4,
      "id": 51
    },
    {
      "userId": 1,
      "recipeId": 17,
      "stars": 4,
      "id": 52
    }
  ],
  "comments": [
    {
      "id": 1,
      "userId": 2,
      "recipeId": 1,
      "text": "This Dutch Oven Campfire Chili was a hit during our camping trip! So easy to make and incredibly flavorful.",
      "date": "2024-02-03T10:15:00Z"
    },
    {
      "id": 2,
      "userId": 1,
      "recipeId": 1,
      "text": "I'm glad you enjoyed it! It's one of my favorite campfire recipes. Did you make any modifications to the ingredients?",
      "date": "2024-02-04T08:45:00Z"
    },
    {
      "id": 3,
      "userId": 4,
      "recipeId": 2,
      "text": "Campfire Pizza is a game-changer! The crust was perfectly crispy, and the toppings were delicious. Highly recommended.",
      "date": "2024-02-05T14:30:00Z"
    },
    {
      "id": 4,
      "userId": 3,
      "recipeId": 2,
      "text": "I agree! I love making it with a variety of toppings. What did you put on yours?",
      "date": "2024-02-06T11:20:00Z"
    },
    {
      "id": 5,
      "userId": 8,
      "recipeId": 3,
      "text": "Dutch Oven Peach Cobbler is a delightful dessert for camping. The peaches were so juicy, and the topping was perfect!",
      "date": "2024-02-07T09:45:00Z"
    },
    {
      "id": 6,
      "userId": 2,
      "recipeId": 3,
      "text": "Thank you so much for sharing this. It's now a family favorite",
      "date": "2024-02-08T07:10:00Z"
    },
    {
      "id": 7,
      "userId": 3,
      "recipeId": 4,
      "text": "Campfire Grilled Chicken Skewers were a hit at our barbecue! The marinade added so much flavor to the chicken.",
      "date": "2024-02-09T16:20:00Z"
    },
    {
      "id": 8,
      "userId": 4,
      "recipeId": 4,
      "text": "I'm glad they turned out well! Did you try any other marinades for the chicken skewers?",
      "date": "2024-02-10T13:55:00Z"
    },
    {
      "id": 9,
      "userId": 1,
      "recipeId": 5,
      "text": "Dutch Oven Bacon and Cheese Campfire Potatoes were a savory delight! The crispy bacon and melted cheese were a perfect combination.",
      "date": "2024-02-11T21:00:00Z"
    },
    {
      "id": 10,
      "userId": 3,
      "recipeId": 5,
      "text": "I'm so glad you enjoyed them! They're a favorite in my camping recipe collection. Any other Dutch oven recipes you recommend?",
      "date": "2024-02-12T18:30:00Z"
    },
    {
      "id": 11,
      "userId": 1,
      "recipeId": 6,
      "text": "Dutch Oven Campfire Breakfast Burritos are the perfect way to start the day outdoors! Hearty and delicious.",
      "date": "2024-02-13T08:15:00Z"
    },
    {
      "id": 12,
      "userId": 2,
      "recipeId": 6,
      "text": "I'm glad you enjoyed the breakfast burritos! They're a camping essential for us. Did you add any special toppings?",
      "date": "2024-02-14T05:40:00Z"
    },
    {
      "userId": 10,
      "recipeId": 21,
      "text": "This was very good! Thank you so much for sharing!",
      "date": "2024-02-18T19:33:04.162Z",
      "id": 13
    }
  ],
  "replies": [
    {
      "id": 1,
      "userId": 3,
      "commentId": 1,
      "replyId": 0,
      "text": "I tried the Dutch Oven Campfire Chili too! It's now a regular in our camping menu. Did you make any side dishes with it?",
      "date": "2024-02-04T12:30:00Z"
    },
    {
      "id": 2,
      "userId": 4,
      "commentId": 1,
      "replyId": 0,
      "text": "Yes, we made some cornbread on the campfire as a side. It complemented the chili perfectly! Highly recommend trying it.",
      "date": "2024-02-05T09:15:00Z"
    },
    {
      "id": 3,
      "userId": 2,
      "commentId": 3,
      "replyId": 0,
      "text": "I'm glad you enjoyed the Campfire Pizza! We added a mix of bell peppers, olives, and pepperoni as toppings. What did you put on yours?",
      "date": "2024-02-06T15:45:00Z"
    },
    {
      "id": 4,
      "userId": 3,
      "commentId": 3,
      "replyId": 0,
      "text": "We went with classic pepperoni and mushrooms. Next time, we'll try your combination!",
      "date": "2024-02-07T11:30:00Z"
    },
    {
      "id": 5,
      "userId": 4,
      "commentId": 5,
      "replyId": 0,
      "text": "Dutch Oven Peach Cobbler is a hit in our family too! Did you try any other Dutch oven desserts during your camping trip?",
      "date": "2024-02-08T18:00:00Z"
    },
    {
      "id": 6,
      "userId": 1,
      "commentId": 5,
      "replyId": 0,
      "text": "Me also made Dutch Oven Apple Crisp. It was a sweet ending to our camping meals!",
      "date": "2024-02-09T14:45:00Z"
    },
    {
      "id": 7,
      "userId": 3,
      "commentId": 7,
      "replyId": 0,
      "text": "The marinade for the Campfire Grilled Chicken Skewers was amazing! Did you try any other grilling recipes during your barbecue?",
      "date": "2024-02-10T22:30:00Z"
    },
    {
      "id": 8,
      "userId": 2,
      "commentId": 7,
      "replyId": 0,
      "text": "Yes, we also grilled some marinated vegetables. It added a nice variety to the meal!",
      "date": "2024-02-11T19:15:00Z"
    },
    {
      "id": 9,
      "userId": 2,
      "commentId": 9,
      "replyId": 0,
      "text": "I'm thrilled you enjoyed the Dutch Oven Bacon and Cheese Campfire Potatoes! Have you tried any other Dutch oven potato recipes?",
      "date": "2024-02-12T10:45:00Z"
    },
    {
      "id": 10,
      "userId": 4,
      "commentId": 9,
      "replyId": 0,
      "text": "We also made loaded baked potatoes in the Dutch oven. It was a hit with everyone!",
      "date": "2024-02-13T07:30:00Z"
    },
    {
      "id": 11,
      "userId": 3,
      "commentId": 11,
      "replyId": 0,
      "text": "Dutch Oven Campfire Breakfast Burritos are a morning favorite for us too! Any tips for making them even better?",
      "date": "2024-02-14T12:00:00Z"
    },
    {
      "id": 12,
      "userId": 1,
      "commentId": 11,
      "replyId": 0,
      "text": "Try adding a bit of hot sauce for an extra kick! It adds a nice flavor to the burritos.",
      "date": "2024-02-15T09:45:00Z"
    },
    {
      "id": 13,
      "userId": 4,
      "commentId": 0,
      "replyId": 1,
      "text": "I'm glad you enjoyed the Dutch Oven Campfire Chili! We tried it too, and it was fantastic. Did you experiment with any different spices?",
      "date": "2024-02-16T14:00:00Z"
    },
    {
      "id": 14,
      "userId": 2,
      "commentId": 0,
      "replyId": 2,
      "text": "The cornbread is a great choice! We often pair it with our campfire meals. Any other favorite campfire recipes you recommend?",
      "date": "2024-02-17T10:30:00Z"
    },
    {
      "id": 15,
      "userId": 1,
      "commentId": 0,
      "replyId": 4,
      "text": "Pepperoni and mushrooms sound delicious! Have you tried adding a sprinkle of Parmesan cheese on top? It takes it to the next level.",
      "date": "2024-02-18T18:45:00Z"
    },
    {
      "id": 16,
      "userId": 4,
      "commentId": 0,
      "replyId": 6,
      "text": "Dutch Oven Apple Crisp sounds amazing! How do you prepare the apples for that dish? Any specific type of apples you recommend?",
      "date": "2024-02-19T08:15:00Z"
    },
    {
      "id": 17,
      "userId": 3,
      "commentId": 0,
      "replyId": 10,
      "text": "Loaded baked potatoes are a classic! Any special toppings or seasonings you use to make them stand out?",
      "date": "2024-02-20T15:00:00Z"
    }
  ]
}